Предполагается, что в рамках данного задания ученики сами будут изучать документацию, как минимум используя функционал `tab` и `shift+tab` от Jupyter

1. Импортируйте библиотеку pandas 
2. Считайте файл `wage.csv` в DataFrame с названием `wage`. Используйте для этого функцию pd.read_csv()

`person_id` - идентификатор человека

`gender` - пол, 0 - женский, 1 - мужской

`wage` - заработная плата в рублях

In [2]:
import pandas as pd
wage = pd.read_csv('./wage.csv')
wage

      person_id  gender           wage
0             0       1   46793.603811
1             1       1   33481.575720
2             2       1   44523.699084
3             3       1   15995.576829
4             4       0   10282.631224
...         ...     ...            ...
1001        995       1   66503.737185
1002        996       1    9972.956272
1003        997       0  104504.616392
1004        998       1   98927.903076
1005        999       1  108107.141368

[1006 rows x 3 columns]

3. Поменяйте колонку `gender` так, чтобы были записи `F` (female) и `M` (male) вместо 0 и 1

In [5]:
wage.loc[wage['gender'] == 1,'gender'] = 'M'
wage.loc[wage['gender'] == 0,'gender'] = 'F'
wage

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[1006 rows x 3 columns]

4. Давайте посчитаем среднюю зарплату у мужчин и женщин. Для этого используйте метод `groupby` со следующим синтаксисом:

`dataframe.groupby(Название_колонки_для_группировки)[Перечисление_колонок_для_агрегации].функция_агрегации()`

In [7]:
wage.groupby('gender')['wage'].mean()

gender
F    40855.747261
M    46815.944005
Name: wage, dtype: float64

5. Теперь взглянем внимательнее на данные и обнаружим, что некоторые люди попали в выборку несколько раз. 
    1. Найдите таких людей. Подсказка: `value_counts()`
    0. Убедитесь, что записи по ним с одинаковым `wage`. Возможно, тут вам пригодится функция агрегации `nunique()`, отображающая количество разных значений
    0. Избавьтесь от повторяющихся значений. Подсказка: `drop_duplicates()`

In [8]:
wage['person_id'].value_counts()

17     2
16     2
15     2
14     2
13     2
      ..
342    1
343    1
344    1
345    1
999    1
Name: person_id, Length: 1000, dtype: int64

In [14]:
for num in [17,16,15,14,13,12]:
    print(wage.loc[wage['person_id'] == num,:])

    person_id gender         wage
22         17      M  20178.98506
23         17      M  20178.98506
    person_id gender          wage
20         16      F  35448.040878
21         16      F  35448.040878
    person_id gender          wage
18         15      F  68341.332163
19         15      F  68341.332163
    person_id gender          wage
16         14      M  13434.655493
17         14      M  13434.655493
    person_id gender           wage
14         13      M  273483.609236
15         13      M  273483.609236
    person_id gender          wage
12         12      M  23547.663281
13         12      M  23547.663281

In [11]:
wage.groupby('person_id')['wage'].nunique()

person_id
0      1
1      1
2      1
3      1
4      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: wage, Length: 1000, dtype: int64

In [15]:
wage.drop_duplicates(inplace=True)
wage

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[1000 rows x 3 columns]

6. Теперь посмотрим внимательнее на зарплаты
    1. Охарактеризуйте имеющиеся данные по зарплатам. Подсказка: `describe`
    1. Избавьтесь от бессмысленных значений

In [27]:
wage['wage'].describe()

count      1000.000000
mean      43694.227404
std       55352.539343
min     -287418.645743
25%       14489.682367
50%       27309.529498
75%       52021.080258
max      755320.874132
Name: wage, dtype: float64

In [34]:
wage.drop(wage.loc[wage['wage']<=0,'wage'].index,inplace=True)

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[995 rows x 3 columns]

7. Давайте теперь посмотрим на зарплату с учетом бонуса. Для этого нам понадобится таблица `bonus.csv`. Считайте ее в переменную `bonus`. Заметьте, что она сохранена немного в другом формате, и вам понадобится уточнить параметр `sep` - разделитель записей. Сравните текущий файл с предыдущим и попробуйте решить проблему

In [39]:
bonus = pd.read_csv('./bonus.csv',sep=';')
bonus = bonus.sort_values('person_id').reset_index(drop=True)
bonus

     person_id         bonus
0            0  3.332934e+04
1            2  3.192912e+06
2            3  2.196858e+04
3            5  5.316780e+04
4            6  1.475011e+04
..         ...           ...
445        991  6.688048e+04
446        992  1.921558e+05
447        995  3.452137e+03
448        996  3.892790e+05
449        997  5.380978e+04

[450 rows x 2 columns]

8. Чтобы посчитать итоговую зарплату, нам нужно по каждому человеку знать и оклад, и премию. Для этого надо будет соединить (сджойнить) таблицы по `person_id`. Используйте для этого функцию `pd.merge`. Помните, что параметр `how` должен быть `'outer'`, чтобы сохранить те записи, что есть только в одной таблице. Результат запишите в новый dataframe `df`

In [41]:
df = pd.merge(left = wage, right=bonus,how='outer')
df

      person_id gender           wage         bonus
0             0      M   46793.603811  3.332934e+04
1             1      M   33481.575720           NaN
2             2      M   44523.699084  3.192912e+06
3             3      M   15995.576829  2.196858e+04
4             4      F   10282.631224           NaN
...         ...    ...            ...           ...
997         995      M   66503.737185  3.452137e+03
998         996      M    9972.956272  3.892790e+05
999         997      F  104504.616392  5.380978e+04
1000        998      M   98927.903076           NaN
1001        999      M  108107.141368           NaN

[1002 rows x 4 columns]

9. Наконец, давайте посчитаем итоговую зарплату
    1. Замените отсутствующие записи в колонке `bonus` нулями
    1. Уберите людей без `wage` - это те "плохие" записи, от которых мы избавлялись на предыдущих шагах
    1. Сделайте новую колонку `total`, которая будет равна 12 окладам и премии
    1. Посчитайте среднюю и медианную итоговую зарплату в разрезе по полу. Подсказка: вместо функции агрегации можно написать `.agg()` и перечислить внутри нужные агрегаты

In [44]:
df.fillna(0,inplace=True)
df.drop(df.loc[df['wage']<=0,'wage'].index,inplace=True)
df['total'] = df['wage']*12 + df['bonus']
df.groupby('gender')['total'].agg(['mean','median'])

                 mean         median
gender
F       570746.139432  347622.913892
M       657142.490282  437499.824868

10. Сохраните `df` в файл, используя метод `to_csv()`. Не записывайте индексы

In [45]:
df.to_csv('wage_results.csv',index=False)